/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   A.cpp                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kotaro666 <kotaro0726@gmail.com>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/28 13:59:03 by kotaro666         #+#    #+#             */
/*   Updated: 2020/02/28 14:00:16 by kotaro666        ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
英小文字のみからなる2つの文字列S,Tが与えられます。
これらの文字列をT,Sの順に空白を空けずに連結し、できる文字列を出力してください。
 */

#include <bits/stdc++.h>
using namespace std;

int main()
{
    string S, T;
    cin >> S >> T;
    cout << T << S << endl;
}